# ============================================================
# Brewfile Bundle
# App descriptions provided by `brew bundle dump --describe`
# ============================================================

# TAPS
# ============================================================

tap "mence/mence"           # Personal tap
tap "buo/cask-upgrade"      # brew-cask-upgrade: a command-line tool for upgrading every outdated app installed by Homebrew Cask.

# BREWS (https://github.com/Homebrew/homebrew-core)
# ============================================================

brew "bat"                  # Clone of cat(1) with syntax highlighting and Git integration
brew "curl"
brew "entr"                 # Run arbitrary commands when files change
brew "fastfetch"            # Like neofetch, but much faster because written mostly in C
brew "fd"                   # Simple, fast and user-friendly alternative to find
brew "ffmpeg"               # Play, record, convert, and stream audio and video
brew "git"
brew "htop"                 # Improved top (interactive process viewer)
brew "icdiff"               # Improved colored diff
brew "imagemagick"
brew "nmap"                 # Port scanning utility for large networks
brew "node"
brew "nvm"
brew "markdownlint-cli"     # CLI for Node.js style checker and lint tool for Markdown files
brew "pandoc"               # Swiss-army knife of markup format conversion
brew "pstree"               # Show ps output as a tree
brew "shellcheck"
brew "the_silver_searcher"  # Code-search similar to ack
brew "tlrc"                 # Official tldr client written in Rust
brew "tree"                 # Display directories as trees (with optional color/HTML output)
brew "yt-dlp"               # Feature-rich command-line audio/video downloader
brew "mas"                  # Mac App Store command-line interface

# BREWS: PERSONAL TAP
# (https://github.com/mence/homebrew-mence/tree/master/Formula)
# ============================================================


# CASKS (https://github.com/Homebrew/homebrew-cask)
# ============================================================

cask "affinity-photo@1"     # Professional image editing software
cask "appcleaner"           # Application uninstaller
cask "balenaetcher"         # Tool to flash OS images to SD cards & USB drives
cask "basictex"             # Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "discord"              # Voice and text chat software
cask "dropbox"              # Client for the Dropbox cloud storage service
cask "espanso"				# Cross-platform Text Expander written in Rust
cask "find-any-file"        # File finder
cask "firefox@esr"          # Web browser
cask "gitx"                 # Git GUI
cask "iterm2"               # Terminal emulator as alternative to Apple's Terminal app
cask "keka"                 # File archiver
cask "namechanger"          # Rename a list of files quickly
cask "obsidian"             # Knowledge base that works on top of a local folder of plain text Markdown files
cask "parsec"               # Remote desktop
cask "sequential"           # Displays folders and archives of images and PDF files
cask "stats"                # System monitor for the menu bar
cask "stolendata-mpv"       # Media player based on MPlayer and mplayer2
cask "sublime-text"         # Text editor for code, markup and prose
cask "switchresx"           # Controls screen display settings
cask "tigervnc-viewer"      # Multi-platform VNC client and server
cask "vscodium"             # Binary releases of VS Code without MS branding/telemetry/licensing
cask "webviewscreensaver"   # Screen saver that displays web pages
cask "xbar"                 # View output from scripts in the menu bar
cask "altserver"            # iOS App Store alternative
cask "little-snitch"
cask "qlmarkdown"           # Quick Look generator for Markdown files
cask "signal"               # Instant messaging application focusing on security
cask "utm"                  # Virtual machines UI using QEMU
cask "docker-desktop"       # App to build and share containerised applications and microservices

# Fonts
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-linux-libertine"
cask "font-source-sans-3"
cask "font-source-code-pro"

# CASKS: PERSONAL TAP
# (https://github.com/mence/homebrew-mence/tree/master/Casks)
# ============================================================

# cask "mence/mence/alfred@2.9_466"  # Application launcher and productivity software
cask "mence/mence/dozer@4"    # Tool to hide status bar icons
cask "mence/mence/nvalt@2.2.8"
# cask "mence/mence/soulver2"  # TODO: Fix file
# cask "mence/mence/keyboard-maestro@6.4.8"